const news_info = [
  {
    id: 1,
    title: "Реконструкція ПЛ 110 кВ Старокозаче-Канал",
    description: `
      У жовтні 2023 року Корпорація «Союз» розпочала виконання робіт згідно проєкту «Реконструкція повітряної лінії 110 кВ «Старокозаче – Канал» 
      на ділянці опор №№ 88-126 для будівництва повітряної лінії 330 кВ «Новоодеська – Арциз» Одеська область, Одеський район» на виконання доручення 
      Прем'єр-міністра України від 14.06.2023 до листа керівника Офісу Президента України від 07.06.2023 під час робочої поїздки Президента
       України до Одеської області 31 травня 2023 року щодо опрацювання питання забезпечення будівництва нової ЛЕП 330 кВ «Новоодеська – Арциз» та запуску її в роботу в 2024 році. <br>
      Постановою НКРЕКП від 20.01.2021 № 57 «Плану розвитку системи передачі на 2021-2030 роки» визначено ряд пріоритетних об’єктів енергетичної галузі, зокрема ЛЕП 330 кВ «Новоодеська - Арциз».<br>
      У зв’язку з військовою агресією російської федерації проти України, яка розпочалася 24 лютого 2022 року, а також за результатами розгляду ситуації, 
      що може мати місце в енергетичній сфері пов’язаною з потенційною загрозою одностороннього припинення постачання електричної енергії на територію України від Молдавської ДРЕС та
       з метою попередження надзвичайної ситуації в ОЕС України, що може призвести до знеструмлення більше ніж 25% споживачів Одеської області, припинення експлуатації об’єктів водопостачання, 
       комунальної і соціальної інфраструктури міста Одеси та Одеської області з причини їх відключення від електропостачання, виникнення загрози життю та здоров’ю населення та завдання значних матеріальних 
       збитків, особливого значення набуває будівництво ЛЕП 330 кВ «Новоодеська - Арциз».
    `,
    images: [
      "./src/assets/images/news_images/rekonstruktsiya_pl_110kv_starokozache_kanal/1723794552149.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_pl_110kv_starokozache_kanal/1729839991862.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_pl_110kv_starokozache_kanal/1729839991889.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_pl_110kv_starokozache_kanal/1729839991896.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_pl_110kv_starokozache_kanal/1723794552149.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_pl_110kv_starokozache_kanal/1729839991916.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_pl_110kv_starokozache_kanal/1729839991931.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_pl_110kv_starokozache_kanal/1729840881662.jpg",
    ],
  },
  {
    id: 2,
    title: "Підписання Меморандуму GE - Союз",
    description: `
      За ініціативою Міністерства енергетики України 14 - 15 листопада у Варшаві відбулася міжнародна конференція «Енергія для відновлення України» (Energy for the recovery of Ukraine). Участь у конференції прийняли представники понад 500 компаній із 30 країн світу.<br>
      Українську делегацію очолив Міністр енергетики України Герман Галущенко.<br>
      Участь у міжнародній конференції та виставці взяли ведучі українські компанії - зокрема державні: 
      Оператор ГТС України, НАЕК «ЕНЕРГОАТОМ», «Центренерго», АТ «Укртрансгаз», АТ «Укргазвидобування», НЕК «Укренерго», «Укргідроенерго». Також долучилися провідні Агентства та інституції - JICA, USAID, Світовий банк та ведучі приватні підприємства енергетичної галузі України.<br>
      Основна мета заходу - залучення міжнародного фінансування для відновлення українських громад, сприяння 
      підприємствам енергетичної галузі України у реалізації відновлення об’єктів критичної інфраструктури, які 
      постраждали внаслідок військової агресії, а також залучення інвестицій у міста та регіони України, які 
      сьогодні підтримують мільйони переміщених сімей та мають привабливі інвестиційні можливості.<br>
      Учасники конференції обговорили питання, пов’язані з енергобезпекою, розвитком «зеленої» енергетики та
      перетворенням України на енергетичний хаб Європи.<br>
      В рамках міжнародної конференції – НЕК «Укренерго» та General Electric домовились про співпрацю
      у проєктах зі зміцнення стійкості української енергосистеми. НЕК «Укренерго» продовжує працювати
      над залученням світового досвіду та передових технологій для розвитку української енергосистеми.
      Одна з нових технологій - використання пристроїв регулювання реактивної потужності STATCOM.
      Це високотехнологічне обладнання, яке підвищує стабільність роботи високовольтної мережі. 
      Під час міжнародної конференції «Енергія для відновлення України», голова правління НЕК «Укренерго» Володимир Кудрицький 
      та керуючий директор GE Energy Power Conversion GmbH Йорг Нуттельманн підписали Меморандум про співпрацю. Угода передбачає спільні 
      дії у дослідженні та реалізації проєктів з встановлення пристроїв STATCOM, будівництва й модернізації високовольтних підстанцій та посилення енергетичної безпеки.<br>
      Корпорація «Союз» 15 листопада 2023 року, в рамках домовленості про співпрацю між НЕК «Укренерго» 
      та General Electric, підписала Меморандум про співробітництво в будівництві підстанцій електропередачі високої напруги, 
      в тому числі SТАТCОМ в Україні з GE Energy Power Conversion GmbH. Меморандум підписали генеральний директор Корпорації «Союз» Ігор Приходько та керуючий директор GE PC GmbH Йорг Нуттельманн.<br>
      Сторони мають намір співпрацювати та виконувати проєкти на основі принципу рівності та взаємної вигоди та відповідно до умов, 
      узгоджених в окремих угодах. На основі технічної документації Корпорація «Союз» розробить разом з GE Energy Power Conversion GmbH 
      необхідні технічні консультації та підготує технічну пропозицію щодо проєктів. При досягненні згоди щодо реалізації проєктів, Корпорація 
      «Союз» та GE Energy Power Conversion GmbH докладатимуть розумних комерційних зусиль для залучення українських трудових ресурсів до процесу реалізації проєкту.<br>
      GE Energy Power Conversion GmbH, як і Корпорація «Союз» мають відмінну репутацію надійних ділових партнерів для підтримки та реалізації енергетичних проєктів в Україні.<br>
      Розвиток стійкої електромережі в Україні є пріоритетом в діяльності НЕК «Укренерго», українських компаній в галузі енергетики спільно з міжнародними партнерами.
    `,
    images: ["./src/assets/images/news_images/memorandum_ge_soyuz/Memorandum_SOYUZ_GE.jpg"],
  },
  {
    id: 3,
    title: "Реконструкція ПЛ 750 кВ ХАЕС-Жешув, ВП ХАЕС з встановленням АТ 750 400 кВ",
    description: `
      У 2022 році Корпорація «Союз» уклала договір з НЕК «Укренерго» - «Виконання комплексу робіт з реконструкції ПЛ 750 кВ ХАЕС-Жешув з переводом на напругу 400 кВ із реконструкцією ВРП 750 кВ ВП «ХАЕС» та встановленням АТ 750/400 кВ». Роботи проводились спільно з польським оператором системи передачі PSE для того щоб вироблена українською енергосистемою електроенергія могла бути передана до Європейського Союзу.<br>
      Модернізована ПЛ 750 кВ ХАЕС-Жешув – потужна міждержавна лінія електропередачі між Польщею та Україною з 27 квітня 2023 року успішно пройшла триденне тестування. Її запуск дає змогу на 25-30% збільшити український експортний потенціал електроенергії. Лінія працюватиме в синхронному режимі, тобто доступ до неї матимуть усі учасники українського та європейського ринків.<br>
      <strong>Роботи завершено у визначений замовником термін.</strong>
    `,
    images: [
      "./src/assets/images/news_images/rekonstruktsiya_pl_750kv_haes_zheshuv_vp_haes_at_750_400kv/POL_slup_przelotowy_linii_750kV.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_pl_750kv_haes_zheshuv_vp_haes_at_750_400kv/XAEC_1.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_pl_750kv_haes_zheshuv_vp_haes_at_750_400kv/XAEC_3.jpg",
    ],
  },
  {
    id: 4,
    title: "Реконструкція ПС 750 кВ Вінницька",
    description: `
      У січні 2021 року Корпорація «Союз» уклала договір з ПрАТ «НЕК «Укренерго» про реконструкцію ПС 750 кВ «Вінницька» яка розташована на території Комарівської сільської ради, 
      Вінницького району, Вінницької області.<br>
      Згідно договору Корпорація «Союз» зобов’язується виконати за завданням замовника роботи з реконструкції ПС 750 кВ «Вінницька» з заміною АТ-2, ТПР АТ-2, встановленням АТ-1, 
      ТПР АТ-1 та впровадженням прогресивних технологічних рішень з передачею замовнику результату робіт.<br>
      Усі роботи на ПС 750 кВ «Вінницька» здійснюються на діючій підстанції.<br>
      <strong>Термін завершення робіт - 2025 рік.</strong>
    `,
    images: [
      "./src/assets/images/news_images/rekonstruktsiya_ps_750kv_vinnytska/20180801_145749.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_ps_750kv_vinnytska/opalubka_i_armirovanie_fundamenta_fm1_at_faza_c.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_ps_750kv_vinnytska/protivopozharnaya_peregorodka_at_faza_v_s_ustanovka_plit.jpg",
      "./src/assets/images/news_images/rekonstruktsiya_ps_750kv_vinnytska/ustanovka_stenok_maslopriemnika_rezervnoi_fazy_at.jpg",
    ],
  },
  {
    id: 5,
    title: "Технічне переоснащення ПС 330 кВ Новокиївська",
    description: `
      У 2017 році Корпорація «Союз» за замовленням ДП НЕК «Укренерго» підписала контракт з технічного переоснащення ПС 330 кВ «Новокиївська», Київська область.<br>
      Проєктування здійснив проєктний інститут - ТОВ «Союзенергопроєкт», м. Харьків.<br>
      Проектом технічного переоснащення ПС 330 кВ «Новокиївська» передбачено: проєктування, виробництво, випробування, 
      постачання, монтаж, налагодження та уведення в експлуатацію КРПЕ 330 та 110 кВ, АТ-3, АТ-2 і іншого устаткування згідно контракту на виконання робіт.<br>
      Будівництво приміщень КРПЕ 330 кВ та 110 кВ, насосної станції пожежогасіння, КЛ 110 кВ, реконструкція ЗРП 330 кВ.<br>
      Виконання будівельно-монтажних і пусконалагоджувальних робіт здійснено українськими будівельними компаніями.
       Змонтовано устаткування виробництва як України так і зарубіжжя.<br>
      Усі роботи на ПС 330 кВ «Новокиївська» здійснено на діючій підстанції.<br>
      <strong>Роботи завершені у 2022 році.</strong>
    `,
    images: [
      "./src/assets/images/news_images/tekhnichne_pereosnashchennya_ps_330kv_novokiivska/02.jpg",
      "./src/assets/images/news_images/tekhnichne_pereosnashchennya_ps_330kv_novokiivska/03.jpg",
      "./src/assets/images/news_images/tekhnichne_pereosnashchennya_ps_330kv_novokiivska/04.jpg",
      "./src/assets/images/news_images/tekhnichne_pereosnashchennya_ps_330kv_novokiivska/05.jpg",
      "./src/assets/images/news_images/tekhnichne_pereosnashchennya_ps_330kv_novokiivska/06.jpg",
      "./src/assets/images/news_images/tekhnichne_pereosnashchennya_ps_330kv_novokiivska/08.jpg",
      "./src/assets/images/news_images/tekhnichne_pereosnashchennya_ps_330kv_novokiivska/20210520_100416.jpg",
      "./src/assets/images/news_images/tekhnichne_pereosnashchennya_ps_330kv_novokiivska/20210520_100511.jpg",
    ],
  },
  {
    id: 6,
    title: "Виконання АВР на ПЛ 330 кВ Миколаївська-Херсонська",
    description: `
      У 2022 році НЕК «Укренерго» уклала договір з Корпорацією «Союз» на виконання аварійно-відновлювальних робіт на ПЛ 330 кВ «Миколаївська-Херсонська»
       на території Миколаївської та Херсонських областей, після їх деокупації. Зазначена повітряна лінія пошкоджена російськими загарбниками.<br>
      За договором Корпорація «Союз» виконала роботи – капітальний ремонт і реставрація обладнання в прогоні опор № 86-98.<br>
      <strong>Роботи виконані в стислі терміни та в повному обсязі.</strong>
    `,
    images: [
      "./src/assets/images/news_images/vykonannya_AVR_na_PL_330kV_Mykolayivska-Khersonska/Zalyshky_rakety.jpg",
      "./src/assets/images/news_images/vykonannya_AVR_na_PL_330kV_Mykolayivska-Khersonska/Poshkodzhena_opora.jpg",
      "./src/assets/images/news_images/vykonannya_AVR_na_PL_330kV_Mykolayivska-Khersonska/PL_330kV_Mykolayivska-Khersonska.jpg",
    ],
  },
];

const params = new URLSearchParams(window.location.search);
const id = parseInt(params.get("id"));
const project = news_info.find((p) => p.id === id);

if (!project) {
  document.getElementById("project_info").innerHTML = "<h2>Новину не знайдено</h2>";
} else {
  document.getElementById("project_title").textContent = project.title;
  document.getElementById("project_description").innerHTML = project.description;

  const gallery = document.getElementById("images_gallery");
  project.images.forEach((imgPath) => {
    const img = document.createElement("img");
    img.className = "gallery_img";
    img.src = imgPath;
    img.alt = "Фото новини";
    gallery.appendChild(img);
  });
}
