const projects_info = [
    {
        id: 1,
        title: "Виконання комплексу робіт з реконструкції ПЛ 750 кВ ХАЕС-Жешув",
        description: "У 2022 році Корпорація «Союз» уклала договір з НЕК «Укренерго» - «Виконання комплексу робіт з реконструкції ПЛ 750 кВ ХАЕС - Жешув з переводом на напругу    400 кВ із реконструкцією ВРП 750 кВ ВП «ХАЕС» та встановленням АТ 750 / 400 кВ».Роботи проводились спільно з польським оператором системи передачі PSE для того щоб вироблена українською енергосистемою електроенергія могла бути передана до Європейського Союзу.  Модернізована ПЛ 750 кВ ХАЕС - Жешув – потужна міждержавна лінія електро - передачі між Польщею та Україною з 27 квітня 2023 року успішно пройшла триденне тестування.Її запуск дає змогу на 25 - 30 % збільшити український експортний потенціал електроенергії.Лінія працюватиме в синхронному режимі, тобто доступ до неї матимуть усі учасники українського та європейського ринків.",
        images: [
            "../../images/projects_images/Rekonstruktsiya_PL_750kV_KHAES_Zheshuv/POL_slup_przelotowy_linii_750kV.jpg",
            "../../images/projects_images/Rekonstruktsiya_PL_750kV_KHAES_Zheshuv/xaec_1.jpg",
            "../../images/projects_images/Rekonstruktsiya_PL_750kV_KHAES_Zheshuv/xaec_2.jpg"
        ],
        categoryPath: "../../pages/projects/projects.html"
    },
    {
        id: 2,
        title: "ВИКОНАННЯ АВР НА ПЛ 330 КВ «МИКОЛАЇВСЬКА-ХЕРСОНСЬКА»",
        description: "У 2022 році НЕК «Укренерго» уклало договір з Корпорацією «Союз» на виконання аварійно- відновлювальних робіт на ПЛ 330 кВ «Миколаївська - Херсонська» на території Миколаївської та Херсонських областей, після їх деокупації.Зазначена повітряна лінія пошкоджена російськими загарбниками." +
            "<br>За договором Корпорація «Союз» зобов’язалася виконати роботи – капітальний ремонт і реставрація в прогоні опор № 86 - 98." +
            "<br>Роботи виконані в стислі терміни та в повному обсязі.",
        images: [
            "../../images/projects_images/AVR_PL_330kV_Mykolaivska_Khersonska/AVR_PL_330kV_Mykolaivska_Khersonska.jpg",
            "../../images/projects_images/AVR_PL_330kV_Mykolaivska_Khersonska/missle.jpg",
            "../../images/projects_images/AVR_PL_330kV_Mykolaivska_Khersonska/damaged_support.jpg",
        ],
        categoryPath: "../../pages/projects/projects.html"
    },
    {
        id: 3,
        title: "РЕКОНСТРУКЦІЯ ПЛ 330 КВ «АДЖАЛИК – ТРИХАТИ»",
        description: "У червні 2021 року ПрАТ «НЕК «Укренерго» уклало договір з Корпорацією «Союз» на виконання робіт з реконструкції ПЛ 330 кВ «Аджалик – Трихати» з улаштуванням заходів на ПС 330 кВ «Тилігул» на території Миколаївської області Миколаївського району, за межами населених пунктів." +
            "<br>За договором Корпорація «Союз» зобов’язується виконати роботи за завданням Замовника: встановлення фундаментів; збирання 9 металевих опор; встановлення опор ПЛ 330 кВ заходів на ПС 330 кВ «Тилігул»; монтаж проводу; грозозахисного тросу; ізоляції та лінійної арматури.",
        images: [
            "../../images/projects_images/Rekonstruktsiya_PL_330kV_Adzhalyk_Trykhati/lep_and_sky.JPG",
        
        ],
        categoryPath: "../../pages/projects/projects.html"
    },
    {
        id: 4,
        title: "РЕКОНСТРУКЦІЯ ПС 330 КВ «ШЕПЕТІВКА» ТА «КАМ’ЯНЕЦЬ-ПОДІЛЬСЬКА»",
        description: "У 2020 році Корпорацією «Союз», на замовлення ПрАТ «НЕК «Укренерго», розпочато реконструкцію ПС 330 кВ «Шепетівка» та «Кам’янець-Подільська» в Хмельницькій області." +
            "<br>Проектами технічного переоснащення електропідстанцій передбачено заміну обладнання 330, 110 кВ та інженерних мереж(вимірювальні трансформатори з оливною ізоляцією 330, 110 кВ, ВЧ- загороджувачі та конденсатори зв’язку 330 кВ, розрядники 330, 110 кВ)." +
            "<br>На  електропідстанції 330 кВ «Кам’янець - Подільська» виконана заміна всього облад - нання 330 та 110 кВ, виконується заміна залізобетонних порталів на металеві." +
            "<br>На ПС 330 кВ «Шепетівка» виконана заміна всього обладнання 330 кВ, виконуються роботи по заміні дев’яти ТС 110 кВ." +
            "<br>Реконструкція ПС 330 кВ «Шепетівка» та «Кам’янець - Подільська» здійснюється для підвищення якості та надійності енергозабезпечення регіону.",
        images: [
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_Shepetivka_Kamyanets/shepetivka_ps_330kv_roboty_vykonuyutsya.jpg",
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_Shepetivka_Kamyanets/shepetivka_zaminene_obladnannya.jpg"
        ],
        categoryPath: "../../pages/projects/projects.html"
    },
    {
        id: 5,
        title: "БУДІВНИЦТВО ФОТОГАЛЬВАНІЧНОЇ ЕЛЕКТРОСТАНЦІЇ «ІНГУЛЕЦЬ»",
        description: "Розвиток зеленої енергетики стало трендом для України в останні роки. Найактивніше розвивається сонячна та вітрова енергетика. Новозбудована Фотогальванічна електростанція «Інгулець» - це ще один вагомий крок до підвищення енергетичної безпеки країни та зниження залежності від імпорту енергоресурсів." +
            "<br>На землях Афанасіївської сільської ради, Снігурівського району Миколаївської області на ділянці землі площею 99,02 га, корпорація «Союз» - генеральний підрядник будівництва, виконала роботи по монтажу панелей гальванічних елементів, прокладена мережа кабелів, встановлені інвертори, трансформатори та інше технологічне обладнання.Всі роботи завершені." +
            "<br>Загальна пікова потужність Фотогальванічної електростанції «Інгулець» - 57, 552 МВт * пік." +
            "<br> <strong>На даний час, після розкрадання станції загарбниками із рф та деокупації Миколаївської області, на ФЕС «Інгулець» здійснюються роботи з відновлення.</strong>",
        images: [
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_Shepetivka_Kamyanets/shepetivka_ps_330kv_roboty_vykonuyutsya.jpg",
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_Shepetivka_Kamyanets/shepetivka_zaminene_obladnannya.jpg"
        ],
        categoryPath: "../../pages/projects/projects.html"
    },
    {
        id: 6,
        title: "РЕКОНСТРУКЦІЯ ПЛ 150 кВ «ГПП НОВА КАХОВКА-ДУДЧИНО»",
        description: "ПАТ	«Енергопостачальна компанія «Херсонобленерго» замовила у Корпорації «СОЮЗ» виконання демонтажу існуючої ПЛ 150 кВ «ГПП Нова Каховка-Дудчино» (всього 170 опор) та будівництво нової повітряної лінії з встановленням нових опор типу: анкерно-кутових; одноланцюгових та дволанцюгових проміжних опор. Також передбачена заміна: проводу, грозозахисного тросу, ізоляції та лінійної арматури." +
            "<br>Реконструкція даної повітряної лінії здійснювалась з метою переносу її за межі населеного пункту Цукури, Каховського району та для підвищення надійності роботи електролінії." +
            "<br>Враховуючи, що повітряна лінія в літній період забезпечує роботу насосних станцій, край необхідних для зрошування сільськогосподарських угідь, роботи виконувались у складних зимових умовах." +
            "<br>Роботи виконані в повному обсязі та на належному рівні." +
            "<br> <strong>На даний час ПЛ 150 кВ «ГПП Нова Каховка- Дудчино» знаходиться на тимчасово окупованій загарбниками із рф територіі.</strong>",
        images: [
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_Shepetivka_Kamyanets/shepetivka_ps_330kv_roboty_vykonuyutsya.jpg",
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_Shepetivka_Kamyanets/shepetivka_zaminene_obladnannya.jpg"
        ],
        categoryPath: "../../pages/projects/projects.html"
    },
    {
        id: 7,
        title: "РЕКОНСТРУКЦІЯ ПС 750 КВ «ВІННИЦЬКА»",
        description: "У січні 2021 року Корпорація «Союз» уклала договір з ПрАТ «НЕК «Укренерго» про реконструкцію ПС 750 кВ «Вінницька» яка розташована на території Комарівської сільської ради, Вінницького району, Вінницької області."+
"<br>ПС 750/330/110/10 кВ «Вінницька» найпотужніша підстанція Південно-Західної енергосистеми Укренерго. Її потужність складає – 1124 МВА."+
"<br>Згідно договору Корпорація «Союз» виконує, за завданням замовника, роботи з реконструкції ПС 750 кВ «Вінницька» з заміною АТ-2, ТПР АТ-2, встановленням АТ-1, ТПР АТ-1 та впровадженням прогресивних технологічних рішень з передачею замовнику результату робіт. " +
"<br>Виконання будівельно-монтажних і пусконалагоджувальних робіт здійснюється українськими будівельними компаніями. Використовується устаткування виробництва як України, так і зарубіжжя. По заверщенню реконструкції - збільшиться потужність та пропускна спроможність підстанції в 2 рази, а у подальшому з’явиться можливість виконати заміну застарілого трансформаторного обладнання. Уведення в експлуатацію нового сучасного обладнання забезпечить підвищення надійності електропостачання споживачів Вінницької області." +
"<br>Усі роботи на ПС 750 кВ «Вінницька» здійснюються на діючій підстанції."+
"<br>Термін завершення робіт - 2025 рік.",
        images: [
            "../../images/projects_images/Rekonstruktsiya_PS_750kV_Vinnytska/20180804_134711.jpg",
            "../../images/projects_images/Rekonstruktsiya_PS_750kV_Vinnytska/20210712_085609.jpg",
            "../../images/projects_images/Rekonstruktsiya_PS_750kV_Vinnytska/20210722_165816.jpg",
            "../../images/projects_images/Rekonstruktsiya_PS_750kV_Vinnytska/20210803_150642.jpg",
            "../../images/projects_images/Rekonstruktsiya_PS_750kV_Vinnytska/TS_2.jpg",
        ],
        categoryPath: "../../pages/projects/projects_2.html"
    },
    {
        id: 8,
        title: "ТЕХНІЧНЕ ПЕРЕОСНАЩЕННЯ ПС 330 КВ «НОВОКИЇВСЬКА»",
        description: "У 2017 році Асоціація - Корпорація «Союз» Україна-ТОВ СП «Союзкомплект» Казахстан за замовленням ДП НЕК «Укренерго» підписали контракт з технічного переоснащення ПС 330 кВ «Новокиївська»." +
"<br>Проєктування здійснено проєктним інститутом - ТОВ «Союзенергопроект» Харків, Україна." +
"<br>Проєктом технічного переоснащення ПС 330 кВ «Новокиївська» передбачено: проєктування, виробництво, випробування, постачання КРПЕ 330 і 110 кВ, АТ-3, АТ-2 та іншого обладнання, монтаж, налагодження та уведення в експлуатацію згідно контракту на виконання робіт." +
"<br>Виконання будівельно-монтажних і пусконалагоджувальних робіт  здійснювалося українськими будівельними підприємствами. Використано обладнання виробництва України та зарубіжжя.",
        images: [
            "../../images/projects_images/Tekhnichne_pereosnashchennya_PS_330kV_Novokyivska/02.jpg",
            "../../images/projects_images/Tekhnichne_pereosnashchennya_PS_330kV_Novokyivska/03.jpg",
            "../../images/projects_images/Tekhnichne_pereosnashchennya_PS_330kV_Novokyivska/04.jpg",
            "../../images/projects_images/Tekhnichne_pereosnashchennya_PS_330kV_Novokyivska/05.jpg",
            "../../images/projects_images/Tekhnichne_pereosnashchennya_PS_330kV_Novokyivska/06.jpg",
            "../../images/projects_images/Tekhnichne_pereosnashchennya_PS_330kV_Novokyivska/20210520_100416.jpg",
            "../../images/projects_images/Tekhnichne_pereosnashchennya_PS_330kV_Novokyivska/20210520_100511.jpg",
        ],
        categoryPath: "../../pages/projects/projects_2.html"
    },
    {
        id: 9,
        title: "РЕКОНСТРУКЦІЯ ПЛ 110 кВ «АДЖАЛИК-БЕРЕГОВА 1,2»",
        description: "На замовлення Державного підприємства «Морський торговельний порт «Южний» фахівцями Корпорації «СОЮЗ» виконані роботи по реконструкції ПЛ 110 кВ «Аджалик-Берегова 1,2». В процесі реконструкції здійснено демонтаж опор типу ПБ-110-8, виконано монтаж нових опор типу ПБ-110-8 на стійки СК 26. Також замінено провід та грозозахисний трос в прольотах." +
"<br>Реконструкція ПЛ 110 кВ «Аджалик-Берегова 1,2» здійснена  з метою підвищення надійності роботи лінії, що забезпечує електроенергією один з найбільших морських портів України.",
        images: [
            "../../images/projects_images/Rekonstruktsiya_PL_110kV_Adzhalyk_Berehova/support_type_PB-110-8.jpg"
        ],
        categoryPath: "../../pages/projects/projects_2.html"
    },
    {
        id: 10,
        title: "БУДІВНИЦТВО ПЛ 750 КВ «РІВНЕНСЬКА АЕС – ПС 750 КВ КИЇВСЬКА»",
        description: "Національна енергетична компанія «Укренерго» запустила в роботу повітряну лінію електропередачі 750 кВ «Рівненська АЕС – ПС 750 кВ Київська»." +
        "<br>Лінія дасть можливість збільшити потужність для київського енерговузла на 700 МВт, виробництво яких забезпечить Рівненська атомна електростанція, що, у свою чергу, дозволить зменшити обсяги теплової генерації." +
        "<br>Будівництво лінії тривало 4 роки. Довжина повітряної лінії складає 353 км, з них 109 км лінії збудувала Корпорація «Союз»." +
        "<br>Фінансування будівництва ЛЕП «Рівненська АЕС – ПС Київська» здійснювалося за рахунок власних коштів ДП НЕК «Укренерго», а також завдяки кредитам Європейського банку реконструкції і розвитку і Європейського інвестиційного банку.",
        images: [
            "../../images/projects_images/Budivnytstvo_PL_750kV_Rivnenska_AES_PS_750kV_Kyivska/IMAG0666.jpg",
            "../../images/projects_images/Budivnytstvo_PL_750kV_Rivnenska_AES_PS_750kV_Kyivska/wire.jpg",
            "../../images/projects_images/Budivnytstvo_PL_750kV_Rivnenska_AES_PS_750kV_Kyivska/20150409_101711.jpg"
        ],
        categoryPath: "../../pages/projects/projects_2.html"
    },
    {
        id: 11,
        title: "БУДІВНИЦТВО КНС 7А та КНС 6Б В М. ОДЕСА",
        description: "У рамках «Проєкту реконструкції магістральної частини системи водовідведення Південного басейну каналізування м. Одеси», який здійснюється з коштів кредиту Всесвітнього Банку для України «Розвиток міської інфраструктури 1», Корпорація виробничих та комерційних підприємств «Союз», як лідер міжнародного консорціуму, побудувала дві нові, сучасні, високоефективні, повністю автоматизовані каналізаційні насосні станції – КНС-7А і КНС-6Б." +
"<br>Максимальна проєктна продуктивність КНС-7А – 10 000 м3 на годину,КНС-6Б – 15 000 м3 на годину. Особливості місцевого рельєфу і глибини залягання магістральних каналізаційних колекторів призвели до того, що підземна частина КНС-6Б була побудована методом «стіна в ґрунті» завглибшки 14 м, а підземна частина КНС-7А – завглибшки 23 м. Разом із самопливним колектором глибокого залягання завдовжки 1,6 км і напірним колектором завдовжки більше 3-х км ці каналізаційні станції утворили основну каналізаційну магістраль Південного басейну Одеси, яка повністю забезпечує збирання і перекачування стоків центру і південної частини міста на Південні очисні споруди."+
"<br>Завдяки будівництву такої потужної каналізаційної магістралі вирішено давню екологічну проблему скидання зливових стоків у Чорне море в районі Аркадії. Потужності старих каналізаційних насосних станцій, розташованих у цьому районі, було недостатньо для ефективного відкачування потужного потоку дощової води і вона самопливом виливалася в море у пляжній зоні."+
"<br>Каналізаційні насосні станції 6Б і 7А повністю замінили старі малопотужні насосні станції, побудовані більше 40-а років тому.",
        images: [
            "../../images/projects_images/Budivnytstvo_KNS_6B_KNS_7A_Odesa/20150622_120946.jpg",
            "../../images/projects_images/Budivnytstvo_KNS_6B_KNS_7A_Odesa/IMG_1947.JPG",
            "../../images/projects_images/Budivnytstvo_KNS_6B_KNS_7A_Odesa/IMG_1811.JPG",
        ],
        categoryPath: "../../pages/projects/projects_2.html"
    },
    {
        id: 12,
        title: "ДЕМОНТАЖ БУДІВЕЛЬНИХ СПОРУД НА ПС 750 кВ «КАХОВСЬКА»",
        description: "На замовлення Державного підприємства Національна енергетична компанія «Укренерго» Корпорацією «Союз» виконано роботи з демонтажу будівель, металоконструкцій та споруд на ПС 750 кВ «Каховська» за проектом «ПЛ 750 кВ Запорізька АЕС – ПС 750 кВ «Каховська» з ПС 750 кВ «Каховська» та заходами ПЛ 330 кВ»." +
      "<br>Роботи виконані в повному обсязі.",
        images: [
            "../../images/projects_images/Demontazh_budivel_PS_750kV_Kakhovska/SAM_3010.JPG",
            "../../images/projects_images/Demontazh_budivel_PS_750kV_Kakhovska/SAM_3014.JPG",
            "../../images/projects_images/Demontazh_budivel_PS_750kV_Kakhovska/demontazh_budivel_ PS_750kV_Kakhovska.JPG"            
        ],
        categoryPath: "../../pages/projects/projects_2.html"
    },
    {
        id: 13,
        title: "БУДІВНИЦТВО ПС 750/330 кВ «КАХОВСЬКА»",
        description: "У 2014 році Корпорація «Союз» розпочала будівництво ПС 750/330 кВ «Каховська» в межах загальнонаціональної Енергетичної стратегії України до 2030 року під проєктним фінансуванням Європейського банку реконструкції та розвитку. Замовником будівництва є Національна енергетична компанія «Укренерго». " +
"<br>ПС 750/330 кВ «Каховська» – нове будівництво цього типу підстанцій в Україні. Встановлена потужність трансформатора становить 1 000 МВА. " + 
"<br><strong>Роботи проводяться з суворим дотриманням норм якості та техніки безпеки:</strong>" +
"<br>- ISO 9001 Стандарт якості;"+
"<br>- DIN і IEC стандарти;"+
"<br>- DEABB GP 81 Послідовність виконання проєктів."+
"<br>В жовтні 2016 року підписано «Акт про завершення робіт» на ПС 750/330 кВ «Каховська»."+
"<br>Новозбудована ПС 750/330 кВ значно підвищить енергетичну ефективність експлуатації Запорізької АЕС, стабільність енергозабезпечення Південного регіону країни, рівень енергетичної ефективності системи передачі енергії й забезпечить сумісність з Європейською системою.",
        images: [
            "../../images/projects_images/Budivnytstvo_PS_750kV_Kakhovska/3_15.jpg",
            "../../images/projects_images/Budivnytstvo_PS_750kV_Kakhovska/20160726_173054.jpg",
            "../../images/projects_images/Budivnytstvo_PS_750kV_Kakhovska/Kakhovska_ORU_330kV_24.2_11.2.1.jpg",
            "../../images/projects_images/Budivnytstvo_PS_750kV_Kakhovska/Kakhovskaya_750_vid_sverkhu.JPG",
            "../../images/projects_images/Budivnytstvo_PS_750kV_Kakhovska/Kakhovskaya_oktyabr_2016_1.jpg",
            "../../images/projects_images/Budivnytstvo_PS_750kV_Kakhovska/Kakhovskaya_ORU_750kV.jpg",
        ],
        categoryPath: "../../pages/projects/projects_3.html"
    },
    {
        id: 14,
        title: "РЕКОНСТРУКЦІЯ ВРП 110 кВ ПС 330 кВ «УСАТОВЕ»",
        description: "На замовлення відокремленого підрозділу «Південна електроенергетична система» ДП «Національна енергетична компанія «Укренерго» фахівцями Корпорації  «Союз» виконано роботи, зазначені в Завданні на проєктування: «Роботи з розробки робочого проєкту «Реконструкція ВРП-110 кВ ПС 330 кВ «Усатове» для приєднання ПС 110 кВ «Маразліївська»." +
"<br>Роботи виконані у зазначений договором термін.",
     images: [
            "../../images/projects_images/VRP_110KV_PS_330kV_Usatove_proektuvannya/13photo.JPG",
            "../../images/projects_images/VRP_110KV_PS_330kV_Usatove_proektuvannya/24photo.JPG",
        ],
        categoryPath: "../../pages/projects/projects_3.html"
    },
    {
        id: 15,
        title: "РЕКОНСТРУКЦІЯ ВРП 110 кВ ПС 330 кВ «УСАТОВЕ»",
        description: "Завдання реконструювати підстанцію 330 кВ «Усатове» для приєднання ПС 110 кВ «Маразліївська», було поставлено перед Корпорацією «Союз» Південною енергосистемою НЕК «Укренерго»."+
"В межах проєкту «Роботи з реконструкції ВРП 110 кВ ПС 330 кВ «Усатове» для приєднання ПС-110 кВ «Маразліївська» на ВРП 110 кВ ПС «Усатове» було замінено все первинне обладнання, яке використало свій технічний ресурс. В процесі реконструкції було змонтовано 4 елегазових вимикача (виробник SIEMENS), 14 фаз трансформаторів напруги (виробник SIEMENS), 15 фаз трансформаторів струму (виробник SIEMENS), 20 триполюсних роз’єднувачів з рухомим ходом головних заземлюючих ножів (виробник АВВ). "+
"Всі роботи велись в умовах діючого ВРП 110 кВ."+
"Виконані роботи на ПС 330 кВ «Усатове» дозволили підключити до неї міську електричну підстанцію 110 кВ «Маразліївська», яка забезпечує електроенергією центральну частину міста Одеса. По інформації НЕК «Укренерго», підрядник робіт на ПС 330 кВ «Усатове» - Корпорація «Союз», своєчасно та якісно виконала заплановані роботи.",
     images: [
,
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_VRP_110kV_Usatove/3photo.JPG",
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_VRP_110kV_Usatove/7photo.JPG",
        ],
        categoryPath: "../../pages/projects/projects_3.html"
    },
    {
        id: 16,
        title: "РЕКОНСТРУКЦІЯ ТУРБОГЕНЕРАТОРА ТГВ – 200 НА ЕНЕРГОБЛОЦІ №5 ДТЕК БУРШТИНСЬКА ТЕС",
        description: "На замовлення Публічного акціонерного товариства «Західенерго» Корпорація «Союз» взяла на себе зобов’язання виконати роботи з реконструкції генератора та його системи тиристорного збудження енергоблоку № 5 ДТЕК Бурштинська ТЕС." +
"<br>В ході реконструкції турбогенератора енергоблоку № 5 у зазначені договором строки виконані роботи:" +
"<br>Реконструкція ТГВ – 200" +
"<br><strong>Для забезпечення збільшення потужності генератора виконано:</strong>" +
"<br>✓ повну заміну обмоток статора та відновлення характеристик активного заліза на майданчику КТЦ Бурштинської ТЕС;"+
"<br>✓ реконструкція ротора на  виробничому майданчику заводу - виробнику;"+
"<br>✓ розроблено проєкт заміни водневого охолодження обмоток статора на водяне, а також заміни системи збудження генератора."+
"<br><strong>Система збудження UNITROL 6800:</strong>"+
"<br>✓ виконано монтаж системи збудження;"+
"<br>✓ реконструйовано вузол вибору резервного збудника з заміною роз’єднувачів постійного струму і захисної шафи;"+
"<br>✓ встановлено систему захисту трансформатора збудження та систему інтерфейсного зв’язку з блочним щитом керування."+
"<br>Характерною ознакою реконструкції системи збудження було виконання, за замовленням станції, можливості роботи системи в асинхронному режимі."+
"<strong><br>На даний час Бурштинська ТЕС зазнала значних пошкоджень через обстріли рф.</strong>",
     images: [
            "../../images/projects_images/Rekonstruktsiya_TGV-200_Burshtynska_TES/Systema_zbudzhennya.JPG",
            "../../images/projects_images/Rekonstruktsiya_TGV-200_Burshtynska_TES/TGV_200.JPG",
            "../../images/projects_images/Rekonstruktsiya_TGV-200_Burshtynska_TES/Vyd_Burshtynskoi_TES.JPG",
            
        ],
        categoryPath: "../../pages/projects/projects_3.html"
    },
    {
        id: 17,
        title: "РЕКОНСТРУКЦІЯ ЕЛЕКТРОТЕХНІЧНОГО ОБЛАДНАННЯ ЕНЕРГОБЛОКУ №5 ДТЕК БУРШТИНСЬКА ТЕС",
        description: "На замовлення Публічного акціонерного товариства «Західенерго» Корпорація «Союз» взяла на себе зобов’язання в 10-ти місячний термін виконати роботи з реконструкції електротехнічного обладнання енергоблоку № 5 ДТЕК Бурштинська ТЕС."+
"<br><strong>В ході  реконструкції електротехнічної частини енергоблоку №5 виконані роботи:</strong>"+
"<br>✓ ремонт синхронних електродвигунів кулькових млинів КБМ, реконструкція систем збудження електродвигунів млинів з заміною електромашинного збудження на статичні тиристорні збуджувачі ВТЕ320/150;"+
"<br>✓ заміна високовольтних та низьковольтних електродвигунів основного та допоміжного технологічного обладнання;"+
"<br>✓ реконструкція кабельного господарства енергоблоку та системи освітлення;"+
"<br>✓ реконструкція КРП-6кВ із заміною масляних вимикачів на вакуумні ВР-2 та реконструкція релейного захисту та автоматики комірок розподільчої підстанції;"+
"<br>✓ впровадження системи мікропроцесорних захистів блоку «Генератор – Трансформатор», системи захисту від замикань на «землю» АЛЬТРА-32 та системи реєстрації аварійних процесів «РЕГІНА»;"+
"<br>✓ капітальний ремонт трансформатора власних потреб ТРДН 25000/35А;"+
"<br>✓ реконструкція ВРП-220кВ з заміною повітряних роз’єднувачів РЛНД-220кВ на сучасні SGF245 та заміною трансформаторів струму ТФНД-220 на сучасні IMB 245;"+
"<br>✓ реконструкція статора та ротора турбогенератора ТГВ-200, з переводом на водяне охолодження обмоток статора, та заміною системи збудження на сучасну тиристорну систему UNITROL 6800 в комплекті з трансформатором."+
"<br><strong>Реконструкція КБМ:</strong>"+
"<br>Виконано капітальний ремонт синхронних електродвигунів з повною заміною обмоток статора та ротора; проектування реконструкції системи збудження; постачання тиристорних збудників ВТЕ 320/150, трансформаторів, шафи управління вибором резервного збудника та необхідних матеріалів; демонтаж електромашинного збудника, монтаж обладнання; відновлення працездатності резервного збудника; пусконалагоджувальні роботи."+
"<br><strong>Реконструкція КРП – 6кВ:</strong>"+
"<br>✓ Розроблена проєктна документація на заміну викатних елементів з масляними вимикачами;"+
"<br>✓ здійснено постачання високовольтного обладнання, пристроїв релейного захисту та управління;"+
"<br>✓ виконано заміну й адаптацію кожного викатного елементу підстанції,  встановлення та випробування пристроїв РЗА."+
"<br>Після завершення робіт з заміни високовольтних електродвигунів та реконструкції кабельного господарства виконані  індивідуальні та комплексні випробування обладнання."+
"<br><strong>Реконструкція ВРП – 220кВ:</strong>"+
"<br>Виконано проєкт з заміни повітряних роз’єднувачів, трансформаторів струму, шинних опор та встановлення обмежувачів перенапруги на пристанційному вузлу."+
"<br>Заміна роз’єднувачів та трансформаторів струму включала в себе демонтаж старого обладнання, відновлення залізобетонних конструкцій, виготовлення індивідуальних металевих конструкцій, встановлення нового обладнання та роботи по монтажу шаф управління і кабельно-провідникової продукції."+
"<br><strong>Ремонт трансформатора власних потреб ТРДН 25000/35А</strong>"+
"<br>Ремонт виконувався за розробленою та погодженою із Замовником програмою, яка передбачала ремонт активної частини трансформатору з її вийманням, ремонт зовнішнього обладнання, в тому числі  масло охолоджувачів, РПН та іншого, заміну трансформаторного масла та відновлення захисного лакофарбового покриття."+
"<br><strong>На даний час Бурштинська ТЕС зазнала значних пошкоджень через обстріли рф.</strong>",
     images: [
            "../../images/projects_images/Rekonstruktsiya_elektrotekhnichnoho_oblad_Burshtynska_TES/TRDN_25000_35A.JPG",
            "../../images/projects_images/Rekonstruktsiya_elektrotekhnichnoho_oblad_Burshtynska_TES/VRP_220KV.JPG",
        ],
        categoryPath: "../../pages/projects/projects_3.html"
    },
    {
        id: 18,
        title: "РЕКОНСТРУКЦІЯ ПЛ 330 кВ АДЖАЛИК - УСАТОВЕ",
        description: "На замовлення Державного підприємства «Національна енергетична компанія «Укренерго» Корпорацією «Союз»  розроблено проєкт землеустрою та робочий проєкт, виконано будівельно-монтажні та пусконалагоджувальні роботи, здійснено постачання обладнання по об’єкту «Реконструкція дволанцюгової ділянки  ПЛ 330 кВ «Аджалик 2 – Усатове – Молдавська ДРЕС – Усатове». Роботи проводились в ускладнених умовах, за межами населених пунктів с. Нерубайське та с. Усатове."+
         "<br><strong>Довжина лінії складає  12 км.</strong>"+
          "<br>Підключення нової  ПЛ 330 кВ «Аджалик 2 – Усатове – Молдавська ДРЕС – Усатове» значно покращило надійність Одеського енерговузла та Півдня України.",
     images: [
            "../../images/projects_images/Rekonstruktsiya_PL_330kV_Adzhalyk_Usatove/P9260295.JPG",
            "../../images/projects_images/Rekonstruktsiya_PL_330kV_Adzhalyk_Usatove/mgs_cifra.jpg",
            "../../images/projects_images/Rekonstruktsiya_PL_330kV_Adzhalyk_Usatove/IMG_7886.JPG",
            "../../images/projects_images/Rekonstruktsiya_PL_330kV_Adzhalyk_Usatove/events.jpg",
            "../../images/projects_images/Rekonstruktsiya_PL_330kV_Adzhalyk_Usatove/VL_330_Adzhalyk_2_Usatovo_MoldGRES_Usatovo.JPG",
        ],
        categoryPath: "../../pages/projects/projects_3.html"
    },
    {
        id: 19,
        title: "ПЛ 110 кВ СЕС «СОНЯЧНА - АРЦИЗ», ПС 110 кВ СОНЯЧНА-АРЦИЗ",
        description: "У межах реалізації Національного проєкту «Енергія природи», Корпорація «Союз» завершила будівельно-монтажні та пусконалагоджувальні роботи на пристанційному вузлі ПС 110 кВ Сонячна- Арциз в Одеській області."+
"<br>Замовник – Державне підприємство «Національна енергетична компанія «Укренерго»." +
"<br>Будівництво об’єкта передбачено Державною цільовою економічною програмою енергоефективності на 2010-2016 р.р. для забезпечення підвищення потужності сонячних електростанцій.",
     images: [
            "../../images/projects_images/PL_110KV_Sonyachna_Artsyza/Artsyzz-Solnechnaya.jpg",
            "../../images/projects_images/PL_110KV_Sonyachna_Artsyza/Montazh_oborudovaniya_Artsyzz-Solnechnaya.jpg",
            "../../images/projects_images/PL_110KV_Sonyachna_Artsyza/Zobrazhennya0824.jpg",
        ],
        categoryPath: "../../pages/projects/projects_4.html"
    },
    {
        id: 20,
        title: "ПЛ 110 кВ СЕС «СОНЯЧНА - КІЛІЯ», ПС 110 кВ СОНЯЧНА - КІЛІЯ",
        description: "У межах реалізації Національного проєкту «Енергія природи» Корпорація «Союз» завершила будівельно-монтажні та пусконалагоджувальні роботи на пристанційному вузлі ПС 110 кВ Сонячна- Кілія в Одеській області. Компанія встановила два силових трансформатора 110 кВ ТРДН-40000/110-У1 потужністю 40 МВА, змонтовано відкритий розподільний пристрій (ВРП) 110 кВ, збудовані приміщення КРПЗ-10 і загального пункту управління. Також збудовано дволанцюгову повітряну лінію 110 кВ від пристанційного вузла до ПС 110 кВ Кілія, довжиною 9,5 км." +
"<br>Пристанційний вузол збудований для сонячної електростанції, яка буде виробляти електроенергію за рахунок сонячних батарей. Електроенергія, вироблена станцією, передаватиметься на пристанційний вузол, буде підвищуватись до 110 кВ та по лінії електропередач передаватиметься до загальної електромережі, на підстанцію 110 кВ Кілія" +
"<br>Реалізація Національного проєкту «Енергія природи» почала діяти  в Україні у 2011 році та дозволить щорічно виробляти 5 млрд кВт/год екологічно чистої електроенергії на протязі 25 років. У результаті, вже до 2014 року, частина відновлюваних джерел енергії у національному енергетичному виробництві збільшиться з існуючих 0,04% до 3%." +
"<br>Будівництво сонячної електростанції  дало можливість створити нові робочі місця у регіоні, поповнити місцевий бюджет, забезпечити повну енергетичну незалежність від постачання електроенергії з сусідньої Молдови.",
     images: [
            "../../images/projects_images/PL_110KV_Sonyachna_Kiliya/0822.jpg",
            "../../images/projects_images/PL_110KV_Sonyachna_Kiliya/0826.jpg",
            "../../images/projects_images/PL_110KV_Sonyachna_Kiliya/0827.jpg",
            "../../images/projects_images/PL_110KV_Sonyachna_Kiliya/0829.jpg",
            
        ],
        categoryPath: "../../pages/projects/projects_4.html"
    },
    {
        id: 21,
        title: "РЕКОНСТРУКЦІЯ ПС 330 кВ УСАТОВЕ",
        description: "У грудні 2012 року ДП НЕК «Укренерго» увела в експлуатацію, після реконструкції, ПС 330 кВ «Усатове» Південної ЕС з установкою трансформатора (5АТ) потужністю 200 МВА (декларація про готовність об'єкта до експлуатації зареєстрована інспекцією ДАБК в Одеській області 19.12.12 р.)"+
"<br>Будівництво об'єкта передбачено схемою розвитку ОЕС України на 2010 рік з пер-спективою до 2015 року для надійності енергопостачання м. Одеси і Одеської області." +
"<br><strong>Роботи виконані Корпорацією «СОЮЗ»</strong>",
     images: [
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_Usatove/Events_0011.jpg",
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_Usatove/PS_330_Usatovo.JPG",
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_Usatove/vents_0012_1.jpg",
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_Usatove/events_13.jpg",
            
        ],
        categoryPath: "../../pages/projects/projects_4.html"
    },
    {
        id: 22,
        title: "РЕКОНСТРУКЦІЯ ПЛ 220 кВ ЦЕНТРОЛІТ - КОМІНТЕРНОВЕ",
        description: "На замовлення відокремленого підрозділу «Південна електроенергетична система» ДП «Національна енергетична компанія «Укренерго» фахівцями Корпорації  «Союз» виконано роботи: «Реконструкція ПЛ 220 кВ Центроліт – Комінтернове в прогоні опор № 1 – 99 з заміною залізобетонних  опор та грозозахисного тросу»."+
"<br>Зазначені роботи проводились в ускладнених умовах. ПЛ 220 кВ Центроліт – Комінтернове знаходиться в зоні сильної дії наведеної напруги. Замовник визначив обмежені строки реалізації договору. Роботи виконані якісно та у визначені терміни.",
     images: [
            "../../images/projects_images/Rekonstruktsiya_PL_220kV_Centrolit_Kominternove/P8100028.JPG", 
            "../../images/projects_images/Rekonstruktsiya_PL_220kV_Centrolit_Kominternove/P8100031.JPG", 
            
        ],
        categoryPath: "../../pages/projects/projects_4.html"
    },
    {
        id: 23,
        title: "РЕКОНСТРУКЦІЯ ПС 220 кВ ЦЕНТРОЛІТ",
        description: "На замовлення Державного підприємства «Національна енергетична компанія «Укренерго» фахівцями Корпорації  «Союз» виконано роботи на об’єкті ПС 220 кВ «Центроліт» (Південна ЕС): «Роботи по заміні двох масляних вимикачів 110 кВ типу ВМТ-110 на приєднаннях «Більшовик», «Лузанівка» на елегазові вимикачі з заміною трансформаторів струму ТС-110 на ПС 220 кВ «Центроліт» з виконанням будівельно-монтажних, пусконалагоджувальних та шеф-монтажних робіт з постачанням обладнання."+
"<br>Роботи виконувались в діючій електроустановці, під наведеною напругою.",
     images: [
            "../../images/projects_images/Rekonstruktsiya_PS_220kV_Centrolit/P8100034.JPG", 
            "../../images/projects_images/Rekonstruktsiya_PS_220kV_Centrolit/P8100037.JPG", 
            "../../images/projects_images/Rekonstruktsiya_PS_220kV_Centrolit/P8100038.JPG", 
            "../../images/projects_images/Rekonstruktsiya_PS_220kV_Centrolit/P8100039.JPG", 
            
        ],
        categoryPath: "../../pages/projects/projects_4.html"
    },
    {
        id: 24,
        title: "РЕКОНСТРУКЦІЯ ПЛ 330 кВ КРИВОРІЗЬКА ТЕС - ТРИХАТИ",
        description: "<br>На замовлення Державного підприємства «Національна енергетична компанія «Укренерго» Корпорацією «Союз» виконані роботи з реконструкції лінії електропередач - ПЛ 330 кВ «Криворізька ТЕС-Трихати» із заміною залізобетонних опор та грозозахисного тросу."+
"<br><strong>Довжина лінії складає більш ніж 15 км.</strong>",
     images: [
            "../../images/projects_images/Rekonstruktsiya_PL_330kV_Kryvorizka_TES_Trykhati/PL_330_Kryvorizka_TES_Trykhaty.JPG",  
            "../../images/projects_images/Rekonstruktsiya_PL_330kV_Kryvorizka_TES_Trykhati/PL_330kV_Kryvorizka_TES_Trykhaty.JPG",  
        ],
        categoryPath: "../../pages/projects/projects_4.html"
    },
    {
        id: 25,
        title: "РЕКОНСТРУКЦІЯ ПЛ 330 кВ МОЛДАВСЬКА ДРЕС-КОТОВСЬКА",
        description: "У 2010 році Державне підприємство «Національна енергетична компанія «Укренерго» та Корпорація «Союз» уклали договір підряду на виконання робіт з капітального ремонту ПЛ 330 кВ Молдавська ДРЕС – Котовська." +
"<br>В рамках реалізації договору Корпорація «Союз» зобов’язалася виконати роботи з капітального ремонту ПЛ 330 кВ Молдавська ДРЕС – Котовська з заміною залізобетонних опор типу П–330-2 на залізобетонні опори типу ПБ-330-7н та заміною грозозахисного тросу типу ТК-11 в прогоні опор №№ 382-440." +
"<br>Роботи виконані у встановлений термін та з високою якістю.",
     images: [
            "../../images/projects_images/Rekonstruktsiya_PL_330kV_Kryvorizka_TES_Trykhati/PL_330_Kryvorizka_TES_Trykhaty.JPG",  
            "../../images/projects_images/Rekonstruktsiya_PL_330kV_Kryvorizka_TES_Trykhati/PL_330kV_Kryvorizka_TES_Trykhaty.JPG",  
        ],
        categoryPath: "../../pages/projects/projects_5.html"
    },
    {
        id: 26,
        title: "РЕКОНСТРУКЦІЯ ЕНЕРГОБЛОКУ № 7 БУРШТИНСЬКОЇ ТЕС",
        description: "На замовлення Відкритого акціонерного товариства «Західенерго» Корпорація «Союз» виконала, спільно з компанією ALSTOM, перший в Україні пілотний проєкт «Реконструкція і технічне переоснащення енергоблоку № 7 Бурштинської ТЕС», зокрема:"+
        "<br>- реконструкція циліндра низького тиску турбоагрегату;"+
        "<br>- реконструкція системи гідравлічного регулювання турбіни;"+
        "<br>- реконструкція маслосистеми турбоагрегату."+
        "<br><strong>За наслідками виконання робіт, зокрема за рахунок проведеної реконструкції циліндра низького тиску (ЦНТ) турбіни, досягнуті наступні показники роботи турбоагрегату:</strong>"+
        "<br>- приріст електричної потужності на 12,5 МВт від номінальної (200 МВт);"+
        "<br>- внутрішній відносний ККД проточної частини ЦНТ турбіни складає 89%;"+
        "<br>- зниження питомих витрат тепла (брутто) на турбіну на 120 ккал/кВт/год в порівнянні з результатами випробувань, проведеними до початку робіт з реконструкції ЦНТ турбіни."+
        "<br><strong>На даний час Бурштинська ТЕС зазнала значних пошкоджень через обстріли рф.</strong>",
     images: [
            "../../images/projects_images/Rekonstruktsiya_Energoblok7_Burshtynska_TES/turbine_N7.jpg",  
        ],
        categoryPath: "../../pages/projects/projects_5.html"
    },
    {
        id: 27,
        title: "РЕКОНСТРУКЦІЯ ПЛ 110 кВ УСАТОВЕ-ЦЕНТРОЛІТ",
        description: "На замовлення Відкритого акціонерного товариства «Енергопостачальна компанія «Одесаобленерго» фахівцями Корпорації «Союз» виконано роботи: «Реконструкція  ПЛ 110 кВ Усатове - Центроліт» на відрізку лінії 110 кВ Усатове - Кіровська."+
"<br>Реконструкція повітряної лінії дала можливість безперебійно забезпечити електроенергією північну частину міста Одеса та злагоджену роботу промислових підпрємств.",
     images: [
            "../../images/projects_images/Rekonstruktsiya_PL_110kV_Usatove_Centrolit/P8100001.JPG",  
            "../../images/projects_images/Rekonstruktsiya_PL_110kV_Usatove_Centrolit/P8100003.JPG",  
            "../../images/projects_images/Rekonstruktsiya_PL_110kV_Usatove_Centrolit/P8100008.JPG",  
            "../../images/projects_images/Rekonstruktsiya_PL_110kV_Usatove_Centrolit/P8100012.JPG",  
        ],
        categoryPath: "../../pages/projects/projects_5.html"
    },
    {
        id: 28,
        title: "ЗАМІНА ВИМИКАЧІВ НА ПС 330 кВ ТРИХАТИ",
        description: "Фахівцями Корпорації «Союз» здійснені роботи по заміні повітряних вимикачів 330 кВ типу ВВН-330 та ВВ-330 Б на елегазові вимикачі 420 кВ фірми SIEMENS згідно проєкту на виконання проєктних, будівельно-монтажних, пусконалагоджувальних та шеф-монтажних робіт з постачанням обладнання та навчанням персоналу на ПС 330 кВ Трихати." +
"<br>Роботи виконувались на діючій електропідстанції.",
     images: [
            "../../images/projects_images/Zamina_Vymykachiv_PS_330kV_Trykhati/PS_330kV_Trykhaty.JPG",    
            "../../images/projects_images/Zamina_Vymykachiv_PS_330kV_Trykhati/PS_330_Trykhaty.JPG",    
        ],
        categoryPath: "../../pages/projects/projects_5.html"
    },
    {   
        id: 29,
        title: "РЕКОНСТРУКЦІЯ ПС 330 кВ 1-3 СЕКЦІЙ ВРП 110 кВ УСАТОВЕ",
        description: "Корпорацією «Союз» виконані будівельно-монтажні роботи по об’єкту «Реконструкція ПС 330 кВ «Усатове» з реконструкцією 1-3 секцій ВРП 110 кВ» на замовлення ТОВ «Південна енергетична компанія»."+
"Всі роботи велись в умовах діючого ВРП 110 кВ, в зоні наведеної напруги. Забезпечивши високу якість робіт фахівці Корпорації «Союз» вчасно здали об’єкт.",
     images: [
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_VRP_110kV_Usatove/3photo.JPG", 
            "../../images/projects_images/Rekonstruktsiya_PS_330kV_VRP_110kV_Usatove/7photo.JPG", 
        ],
        categoryPath: "../../pages/projects/projects_5.html"
    },
    {   
        id: 30,
        title: "РЕКОНСТРУКЦІЯ ПЛ 110 кВ УСАТОВЕ - ЧУМКА, ОДЕСЬКА ТЕЦ - ЧУМКА",
        description: "Корпорацією «Союз» виконані будівельно-монтажні та пусконалагоджувальні роботи, постачання обладнання з реконструкції дволанцюгової ПЛ 110 кВ «Усатове – Чумка, Одеська ТЕЦ – Чумка», яка пролягає по території м. Одеса."+
"<br>Роботи проводились в стислі строки, на територіях насичених повітряними та підземними комунікаційними мережами, які ускладнювали умови будівництва." +
"<br>В процесі будівництва були застосовані багатогранні металеві опори, вироблені за сучасними технологіями, улаштування свайних фундаментів здійснювалось методом вдавлювання та буронабивних свай. Фахівцями Корпорації «Союз» була розроблена та використана переносна анкерно-кутова металева опора, що надало можливість забезпечити надійність електропостачання споживачів на час реконструкції даної дільниці.",
     images: [
            "../../images/projects_images/Rekonstruktsiya_PL_110kV_Usatove_Chumka/PL_110KV_Usatove_Chumka_OTEC_Chumka.jpg.JPG", 
            "../../images/projects_images/Rekonstruktsiya_PL_110kV_Usatove_Chumka/PL_110_Usatove_Chumka_OTEC_Chumka.jpg.JPG", 
        ],
        categoryPath: "../../pages/projects/projects_5.html"
    },
    {   
        id: 31,
        title: "ДЕМОНТАЖ ПЛ 330 кВ АДЖАЛИК - УСАТОВЕ",
        description: "  В рамках виконання заходів по об’єкту «Будівництво високовольтної повітряної електричної лінії  330 кВ Аджалик – Усатове» виконані роботи по демонтажу дільниці ПЛ 330 кВ Усатове – Молдавська  ДРЕС між опорами №№ 248-238 та будівництво двоколової ПЛ 330 кВ Аджалик – Усатове на дільниці №№ 51-41."+
"<br>Роботи виконано у встановлений термін.",
     images: [
            "../../images/projects_images/Demontazh_PL_330kV_Adzhalyk_Usatove/SAM_3028.JPG",
        ],
        categoryPath: "../../pages/projects/projects_6.html"
    },
    {   
        id: 32,
        title: "КАПІТАЛЬНИЙ РЕМОНТ ПЛ 400 кВ МОЛДАВСЬКА ДРЕС-ВУЛКАНЕШТИ",
        description: "За замовленням Закритого акціонерного товариства «Молдавська ДРЕС» (Республіка Молдова, ПМР) фахівцями Корпорації «Союз» виконано роботи з капітального ремонту повітряної лінії 400 кВ «Молдавська ДРЕС – Вулканешти»"+
"<br>Роботи проводилися в ускладнених умовах, у прикордонній зоні двох країн – України і Молдови, в плавнях Дністровського лиману (Україна). Перехід повітряної лінії здійснений через ріку Дністер. Терміни виконання робіт були узгоджені з Державним підприємством «Молделектрика» (Молдова). Роботи виконувалися після тимчасового відключення лінії від енергоспоживання."+
"<br>Капітальний ремонт ПЛ 400 кВ «Молдавська ДРЕС – Вулканешти» значно підвищив надійність енерговузла півдня Одеської області (Україна) і південних регіонів Республіки Молдова.",
     images: [
            "../../images/projects_images/Kapitalnyi_remont_PL_400kV_Moldavska_DRES_Vulkaneshty/mold_vulkaneshti.JPG",
        ],
        categoryPath: "../../pages/projects/projects_6.html"
    },
];

const params = new URLSearchParams(window.location.search);
const id = parseInt(params.get("id"));
const project = projects_info.find(p => p.id === id);

if (!project) {
    document.getElementById("project_info").innerHTML = "<h2>Проєкт не знайдено</h2>";
} else {
    document.getElementById("project_title").textContent = project.title;
    document.getElementById("project_description").innerHTML = project.description;

    const gallery = document.getElementById("images_gallery");
    project.images.forEach(imgPath => {
        const img = document.createElement("img");
        img.className = "gallery_img";
        img.src = imgPath;
        img.alt = "Фото проєкту";
        gallery.appendChild(img);
    });
    const topLink = document.getElementById("to_general_link_top");
    const bottomLink = document.getElementById("to_general_link_bottom");

    if (project.categoryPath) {
        if (topLink) topLink.href = project.categoryPath;
        if (bottomLink) bottomLink.href = project.categoryPath;
    }
}
